In [30]:
# This Notebook consists of:
## Import the required libraries
## Create a random data using pd.DataFrame() function
## Create a new column and execute mathematical operations
## Create a flag column

In [1]:
# Import the required libraries
import pandas as pd

In [32]:
# Create a random data using pd.DataFrame() function

In [3]:
df=pd.DataFrame({
    'id':['Paul','Tim','Mary','Tony','Sam'],
    'age':[31,45,90,20,35],
    'income':[50000,70000,25000,5000,100000],
    'married':[True, False, True, False, True]
})
print(df.head())

     id  age  income  married
0  Paul   31   50000     True
1   Tim   45   70000    False
2  Mary   90   25000     True
3  Tony   20    5000    False
4   Sam   35  100000     True

In [11]:
# Create a new column and execute mathematical operations
# adding 10% bonus to the income

In [9]:
multiply_2 = lambda x:x+x*10/100
multiply_2(df['income'])

0     55000.0
1     77000.0
2     27500.0
3      5500.0
4    110000.0
Name: income, dtype: float64

In [13]:
df['bonus_income'] = multiply_2(df['income'])
df

     id  age  income  married  bonus_income
0  Paul   31   50000     True       55000.0
1   Tim   45   70000    False       77000.0
2  Mary   90   25000     True       27500.0
3  Tony   20    5000    False        5500.0
4   Sam   35  100000     True      110000.0

In [17]:
## using apply() function

In [19]:
df['bonus_income1'] = df['income'].apply(lambda x:x+x*10/100)
df

     id  age  income  married  bonus_income  bonus_income1
0  Paul   31   50000     True       55000.0        55000.0
1   Tim   45   70000    False       77000.0        77000.0
2  Mary   90   25000     True       27500.0        27500.0
3  Tony   20    5000    False        5500.0         5500.0
4   Sam   35  100000     True      110000.0       110000.0

In [34]:
## Creating a flag column using Lambda function

In [23]:
df['lambda category'] = df['income'].apply(lambda x: 'high income' if x > 30000 else ('medium income' if x > 7500 else 'low income'))
df

     id  age  income  married  bonus_income  bonus_income1 lambda category
0  Paul   31   50000     True       55000.0        55000.0     high income
1   Tim   45   70000    False       77000.0        77000.0     high income
2  Mary   90   25000     True       27500.0        27500.0   medium income
3  Tony   20    5000    False        5500.0         5500.0      low income
4   Sam   35  100000     True      110000.0       110000.0     high income

In [36]:
# END